In [69]:
import pandas as pd

In [70]:
instagram = pd.read_csv("instagram-sep-2022.csv")
tiktok = pd.read_csv("tiktok-sep-2022.csv")
youtube = pd.read_csv("youtube-sep-2022.csv")

In [71]:
def convert_metric(x):
    last_character = x[-1]
    if last_character == "K":
        without_last = x[:-1]
        return float(without_last) * 1000
    elif last_character == "M":
        without_last = x[:-1]
        return float(without_last) * 1000000
    else:
        return x

# Instagram

In [72]:
instagram.head()

,S.no,Instagram name,Name,Subscribers,Audience country,Authentic engagement\n,Engagement average\n,Category_1,Category_2
0,1,cristiano,Cristiano Ronaldo,477.9M,India,5M,6.2M,Sports with a ball,NaN
1,2,kyliejenner,Kylie ü§ç,368.1M,United States,3.5M,5.5M,Fashion,Modeling
2,3,arianagrande,Ariana Grande,329.6M,United States,2.9M,4M,NaN,NaN
3,4,leomessi,Leo Messi,358.6M,Indonesia,2.7M,3.5M,Sports with a ball,Family
4,5,zendaya,Zendaya,151.1M,United States,4.3M,5.8M,Cinema & Actors/actresses,Fashion

In [73]:
instagram.drop(["Audience country","Authentic engagement\n","Category_1","Category_2"], axis = 1, inplace = True)

In [74]:
instagram["Engagement average\n"] = instagram["Engagement average\n"].apply(lambda x: convert_metric(x)).astype(int)
instagram["Subscribers"] = instagram["Subscribers"].apply(lambda x: convert_metric(x)).astype(int)

In [75]:
instagram.head()

   S.no Instagram name               Name  Subscribers  Engagement average\n
0     1      cristiano  Cristiano Ronaldo    477900000               6200000
1     2    kyliejenner            Kylie ü§ç    368100000               5500000
2     3   arianagrande      Ariana Grande    329600000               4000000
3     4       leomessi          Leo Messi    358600000               3500000
4     5        zendaya            Zendaya    151100000               5800000

In [86]:
instagram.rename( columns={
    "S.no" : "rank",
    "Instagram name": "id",
    "Name" : "name",
    "Subscribers" : "subscribers",
    "Engagement average\n" : "engagement_avg"
}, inplace = True)

In [89]:
instagram.head()

   rank            id               Name  subscribers  engagement_avg
0     1     cristiano  Cristiano Ronaldo    477900000         6200000
1     2   kyliejenner            Kylie ü§ç    368100000         5500000
2     3  arianagrande      Ariana Grande    329600000         4000000
3     4      leomessi          Leo Messi    358600000         3500000
4     5       zendaya            Zendaya    151100000         5800000

# YouTube

In [76]:
youtube.head()

,S.no,Name,Youtuber,Country,Subscribers,Category_2,Avg. views\n,Avg. likes,Avg Comments,Category_3
0,1,T-Series,tseries,India,224.4M,Music & Dance,141.5K,4.6K,125,NaN
1,2,Cocomelon - Nursery Rhymes,checkgate,NaN,142.5M,Education,12.5M,64.8K,0,NaN
2,3,PewDiePie,PewDiePie,United States,111.6M,Animation,1.9M,130.5K,7.4K,NaN
3,4,MrBeast,MrBeast6000,United States,104.1M,Video games,44.8M,2.2M,70.9K,Humor
4,5,‚úø Kids Diana Show,‚úø Kids Diana Show,NaN,100.5M,Animation,6.9M,34.8K,0,Toys

In [77]:
youtube.columns

Index(['S.no', 'Name', 'Youtuber', 'Country', ' Subscribers', 'Category_2',
       'Avg. views\n', 'Avg. likes', 'Avg Comments', 'Category_3'],
      dtype='object')

In [78]:
youtube.drop(["Country","Category_3","Category_2"], axis = 1, inplace = True)

In [79]:
youtube[" Subscribers"] = youtube[" Subscribers"].apply(lambda x: convert_metric(x)).astype(int)
youtube["Avg. views\n"] = youtube["Avg. views\n"].apply(lambda x: convert_metric(x)).astype(int)
youtube["Avg. likes"] = youtube["Avg. likes"].apply(lambda x: convert_metric(x)).astype(int)
youtube["Avg Comments"] = youtube["Avg Comments"].apply(lambda x: convert_metric(x)).astype(int)

In [80]:
youtube.head()

,S.no,Name,Youtuber,Subscribers,Avg. views\n,Avg. likes,Avg Comments
0,1,T-Series,tseries,224400000,141500,4600,125
1,2,Cocomelon - Nursery Rhymes,checkgate,142500000,12500000,64800,0
2,3,PewDiePie,PewDiePie,111600000,1900000,130500,7400
3,4,MrBeast,MrBeast6000,104100000,44800000,2200000,70900
4,5,‚úø Kids Diana Show,‚úø Kids Diana Show,100500000,6900000,34800,0

In [87]:
youtube.rename( columns={
    "S.no" : "rank",
    "Youtuber": "youtuber",
    "Name" : "name",
    " Subscribers" : "subscribers",
    "Avg. views\n" : "views_avg",
    "Avg. likes" : "likes_avg",
    "Avg Comments" : "comments_avg"
}, inplace = True)

In [88]:
youtube.head()

,rank,name,youtuber,subscribers,views_avg,likes_avg,comments_avg
0,1,T-Series,tseries,224400000,141500,4600,125
1,2,Cocomelon - Nursery Rhymes,checkgate,142500000,12500000,64800,0
2,3,PewDiePie,PewDiePie,111600000,1900000,130500,7400
3,4,MrBeast,MrBeast6000,104100000,44800000,2200000,70900
4,5,‚úø Kids Diana Show,‚úø Kids Diana Show,100500000,6900000,34800,0

# TikTok

In [81]:
tiktok.head()

,S.no,Tiktoker name,Tiktok name,Subscribers,Views avg.,Likes avg.,Comments avg.,Shares avg.
0,1,jypestraykids,Stray Kids,13.8M,6.4M,2.3M,50.2K,34.2K
1,2,khaby.lame,Khabane lame,149.2M,17.3M,2.3M,15.2K,8.7K
2,3,scarlettsspam2,scarlett,2.1M,17.9M,845.8K,53.9K,6.3K
3,4,addisonre,Addison Rae,88.7M,22M,906.6K,7.6K,26.2K
4,5,belindatok,Belinda,4.8M,14.2M,1.5M,14.5K,15.3K

In [82]:
tiktok["Views avg."] = tiktok["Views avg."].apply(lambda x: convert_metric(x)).astype(int)
tiktok["Likes avg."] = tiktok["Likes avg."].apply(lambda x: convert_metric(x)).astype(int)
tiktok["Comments avg."] = tiktok["Comments avg."].apply(lambda x: convert_metric(x)).astype(int)
tiktok["Shares avg."] = tiktok["Shares avg."].apply(lambda x: convert_metric(x)).astype(int)

In [83]:
tiktok.head()

,S.no,Tiktoker name,Tiktok name,Subscribers,Views avg.,Likes avg.,Comments avg.,Shares avg.
0,1,jypestraykids,Stray Kids,13.8M,6400000,2300000,50200,34200
1,2,khaby.lame,Khabane lame,149.2M,17300000,2300000,15200,8700
2,3,scarlettsspam2,scarlett,2.1M,17900000,845800,53900,6300
3,4,addisonre,Addison Rae,88.7M,22000000,906600,7600,26200
4,5,belindatok,Belinda,4.8M,14200000,1500000,14500,15300

In [90]:
tiktok.rename( columns={
    "S.no" : "rank",
    "Tiktoker name": "tiktoker",
    "Tiktok name" : "name",
    "Subscribers" : "subscribers",
    "Views avg." : "views_avg",
    "Likes avg." : "likes_avg",
    "Comments avg." : "comments_avg",
    "Shares avg.": "shares_avg"
}, inplace = True)

In [91]:
tiktok.head()

,rank,tiktoker,name,subscribers,views_avg,likes_avg,comments_avg,shares_avg
0,1,jypestraykids,Stray Kids,13.8M,6400000,2300000,50200,34200
1,2,khaby.lame,Khabane lame,149.2M,17300000,2300000,15200,8700
2,3,scarlettsspam2,scarlett,2.1M,17900000,845800,53900,6300
3,4,addisonre,Addison Rae,88.7M,22000000,906600,7600,26200
4,5,belindatok,Belinda,4.8M,14200000,1500000,14500,15300